app/controllers/api/channels_controller.rb

SELECT "channels".* FROM "channels" WHERE "channels"."server_id" = $1  [["server_id", 1]]
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        @channels = Server.find_by(id: params[:server_id]).channels

SELECT  "servers".* FROM "servers" INNER JOIN "server_memberships" ON "servers"."id" = "server_memberships"."server_id" WHERE "server_memberships"."user_id" = $1 AND "servers"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 4], ["LIMIT", 1]]
INSERT INTO "channels" ("server_id", "created_at", "updated_at", "channel_name") VALUES ($1, $2, $3, $4) RETURNING "id"  [["server_id", 4], ["created_at", "2019-11-06 02:51:39.880462"], ["updated_at", "2019-11-06 02:51:39.880462"], ["channel_name", "atest"]]
---
    def create
        @channel = Channel.new(channel_params)
        if(current_user.servers.find_by(id: params[:server_id]))
            @channel.server_id = params[:server_id]
        end

        if @channel.save

SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        if(current_user.servers.find_by(id: params[:server_id]))