app/controllers/api/servers_controller.rb

INSERT INTO "servers" ("admin_id", "server_name", "invite_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["admin_id", 1], ["server_name", "asdasd"], ["invite_url", "a1md0UxJEEwJJg"], ["created_at", "2019-11-04 00:03:55.060156"], ["updated_at", "2019-11-04 00:03:55.060156"]]
INSERT INTO "server_memberships" ("user_id", "server_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["server_id", 3], ["created_at", "2019-11-04 00:10:21.722717"], ["updated_at", "2019-11-04 00:10:21.722717"]]
INSERT INTO "servers" ("admin_id", "server_name", "invite_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["admin_id", 4], ["server_name", "server1"], ["invite_url", "qx-W_mlLTQUhNQ"], ["created_at", "2019-11-04 22:33:08.382823"], ["updated_at", "2019-11-04 22:33:08.382823"]]
---
    def create
        @server = Server.new(server_params)
        @server.admin_id = current_user.id

        if @server.save
            ServerMembership.create({ user_id: current_user.id, server_id: @server.id})

SELECT  "servers".* FROM "servers" INNER JOIN "server_memberships" ON "servers"."id" = "server_memberships"."server_id" WHERE "server_memberships"."user_id" = $1 AND "servers"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
---
    def show
        @server = current_user.servers.find(params[:id])

SELECT  "servers".* FROM "servers" WHERE "servers"."invite_url" = $1 LIMIT $2  [["invite_url", "Do86xSMH8o-fAA"], ["LIMIT", 1]]
INSERT INTO "server_memberships" ("user_id", "server_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["server_id", 3], ["created_at", "2019-11-05 01:48:29.526600"], ["updated_at", "2019-11-05 01:48:29.526600"]]
---
    def join
        @server = Server.find_by_url(params[:invite_url])
        if @server
            ServerMembership.create({ user_id: current_user.id, server_id: @server.id})

SELECT  "servers".* FROM "servers" INNER JOIN "server_memberships" ON "servers"."id" = "server_memberships"."server_id" WHERE "server_memberships"."user_id" = $1 AND "servers"."id" = $2 LIMIT $3  [["user_id", 5], ["id", 43], ["LIMIT", 1]]
SELECT  "server_memberships".* FROM "server_memberships" WHERE "server_memberships"."server_id" = $1 AND "server_memberships"."user_id" = $2 LIMIT $3  [["server_id", 43], ["user_id", 5], ["LIMIT", 1]]
DELETE FROM "server_memberships" WHERE "server_memberships"."id" = $1  [["id", 43]]
---
    def leave
        @server = current_user.servers.find(params[:id])

        if @server
            server_membership = ServerMembership.find_by_membership(@server.id, current_user)
            server_membership.destroy;