discord/app/models/server.rb

    def self.find_by_url(url)
        Server.find_by(invite_url: url)
---
SELECT  "servers".* FROM "servers" WHERE "servers"."invite_url" = $1 LIMIT $2  [["invite_url", "Do86xSMH8o-fAA"], ["LIMIT", 1]]