discord/app/models/server_membership.rb

SELECT  "server_memberships".* FROM "server_memberships" WHERE "server_memberships"."server_id" = $1 AND "server_memberships"."user_id" = $2 LIMIT $3  [["server_id", 43], ["user_id", 5], ["LIMIT", 1]]
---
    def self.find_by_membership(server_id, user_id)
        server_membership = ServerMembership.find_by(server_id: server_id, user_id: user_id)