discord/app/models/user.rb

    def reset_session_token!
        self.update(session_token: SecureRandom.urlsafe_base64)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "dxgOKeTIZhz14lrltOuV3g"], ["updated_at", "2019-11-03 00:27:08.899929"], ["id", 1]]