app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "uNUCrU09gsrbB_-AAHorbw"], ["updated_at", "2019-11-03 21:05:15.195216"], ["id", 1]]
---
    def reset_session_token!
        self.update(session_token: SecureRandom.urlsafe_base64)